04_OpenFoam/_ref/OpenFOAM-14/incompressibleFluid/motorBikeSteady/system/cutPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            surfaces;
libs            ("libsampling.so");

writeControl    writeTime;

surfaceFormat   vtk;

fields          (p U);

interpolationScheme cellPoint;

surfaces
{
    yNormal
    {
        type            cutPlane;
        point           (0 0 0);
        normal          (0 1 0);
        interpolate     true;
    }
}


// ************************************************************************* //
